public_html/org_roam_primeros_pasos.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-roam primeros pasos</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">org-roam primeros pasos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd0273d0">1. Como empezar</a></li>
<li><a href="#orgd768c2f">2. Configuración en init.el</a></li>
</ul>
</div>
</div>
<p>
La curva de aprendizaje de <a href="org_roam.html#ID-80ce4bf8-3936-45bf-adc9-041795828500">org-roam</a> es complicada sin una guía adecuada que serguir, estos son los primeros pasos por donde hay que empezar si quieres crear tu base de conocimiento.
</p>

<div id="outline-container-orgd0273d0" class="outline-2">
<h2 id="orgd0273d0"><span class="section-number-2">1.</span> Como empezar</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>En caso de configuración compartida, no sincronizar la carpeta "elpa"</li>
<li>Instalar y activar "ivy-mode"</li>
<li>Instalar "org-roam"</li>
<li>Instalar "org-roam-ui"</li>
</ul>

<blockquote>
<p>
La instalación de "emacsql" como dependencia de "Org-roam" me ha dado muchos problemas de compilación. Finalmente he conseguido que funcione eliminando del sistema el compilador "gcc" e instalando "clang" tal y como se comenta en el <a href="https://www.orgroam.com/manual.html#C-Compiler">manual</a> online.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgd768c2f" class="outline-2">
<h2 id="orgd768c2f"><span class="section-number-2">2.</span> Configuración en init.el</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-elisp">(make-directory <span style="color: #95e454;">"~/conocimiento"</span> t)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-roam-directory (file-truename <span style="color: #95e454;">"~/conocimiento"</span>))
(org-roam-db-autosync-mode)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-roam-completion-system 'ivy)
(<span style="color: #8ac6f2; font-weight: bold;">setq</span> org-roam-completion-everywhere t)
(ivy-mode 1)

(global-set-key (kbd <span style="color: #95e454;">"C-c n f"</span>) 'org-roam-node-find)
(global-set-key (kbd <span style="color: #95e454;">"C-c n l"</span>) 'org-roam-buffer-toggle) el Buffer Org-Roam
(global-set-key (kbd <span style="color: #95e454;">"C-c n i"</span>) 'org-roam-node-insert)
(global-set-key (kbd <span style="color: #95e454;">"C-c n t"</span>) 'org-roam-tag-add)
(global-set-key (kbd <span style="color: #95e454;">"C-c n a"</span>) 'org-roam-alias-add)
(global-set-key (kbd <span style="color: #95e454;">"C-c n o"</span>) 'org-id-get-create)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-30 mié 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
